## 데이터프레임과 시리즈

#### 시리즈 만들기

In [145]:
import pandas as pd

In [146]:
s = pd.Series(['Wes McKINNEY','Creator of Pandas'])
print(s)

0         Wes McKINNEY
1    Creator of Pandas
dtype: object

In [147]:
s = pd.Series(['Wes McKINNEY','Creator of Pandas'], index=['Person','Who'])
print(s)

Person         Wes McKINNEY
Who       Creator of Pandas
dtype: object

#### 데이터 프레임 만들기

In [148]:
scientists = pd.DataFrame({
    'Name' : ['Rosaline Franklin', 'William Gosset'],
    'Occupation' : ['Chemist','Statistician'],
    'Born' : ['1920-07-25','1876-06-13'],
    'Died' : ['1958-04-16','1937-10-16'],
    'Age' : [37,61]})
print(scientists)

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [149]:
scientists = pd.DataFrame(
    data = {'Occupation' : ['Chemist','Statistician'],
            'Born' : ['1920-07-25','1876-06-13'],
            'Died' : ['1958-04-16','1937-10-16'],
            'Age' : [37,61]},
    index = ['Rosaline Franklin','Wiiliam Gosset'],
    columns=['Occupation','Born','Died','Age'])
print(scientists)

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
Wiiliam Gosset     Statistician  1876-06-13  1937-10-16   61

In [150]:
scientists = pd.DataFrame(
    data = {'Occupation' : ['Chemist','Statistician'],
            'Born' : ['1920-07-25','1876-06-13'],
            'Died' : ['1958-04-16','1937-10-16'],
            'Age' : [37,61]},
    index = ['Rosaline Franklin','Wiiliam Gosset'],
    columns=['Occupation','Born','Died','Age'])

first_row = scientists.loc['Wiiliam Gosset']
print(type(first_row))
print(first_row)

<class 'pandas.core.series.Series'>
Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: Wiiliam Gosset, dtype: object

In [151]:
first_irow = scientists.iloc[1]
print(first_irow)

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: Wiiliam Gosset, dtype: object

In [152]:
print(first_row.index)  # 컬럼명 추출
print(first_row.values)
print(first_row.keys())  #==index속성

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')
['Statistician' '1876-06-13' '1937-10-16' 61]
Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

#### 시리즈 다루기 - 기초
- 기초 통계 메소드 사용하기

In [153]:
ages = scientists['Age']
print(ages)

Rosaline Franklin    37
Wiiliam Gosset       61
Name: Age, dtype: int64

In [154]:
print(ages.mean())
print(ages.max())
print(ages.min())
print(ages.std())

49.0
61
37
16.97056274847714

In [114]:
scientists.describe()

             Age
count   2.000000
mean   49.000000
std    16.970563
min    37.000000
25%    43.000000
50%    49.000000
75%    55.000000
max    61.000000

#### 시리즈 다루기 - 응용

In [160]:
# 평균 나이보다 나이가 많은 사람 데이터 구하기
scientists = pd.read_csv('C:/STUDY/Pandas/scientists.csv')
ages = scientists['Age']
print(ages.max(), ages.mean())

90 59.125

In [161]:
print(ages.describe().loc['max'])

90.0

In [162]:
# boolean array 추출
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [163]:
# 평균나이보다 나이가 많은 사람 데이터 구하기
manual_bool_values = [False,True,True,True,False,False,False, True]
print(ages[manual_bool_values])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

- 브로드캐스팅(Broadcasting)
> 시리즈와 같이 여러 개의 값을 가진 데이터(벡터)와 단순 크기를 나타내는 데이터(스칼라) 간의 연산 지원

In [164]:
print(ages + ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [165]:
# 벡터 +  스칼라
print(ages + 100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [166]:
# 길이가 서로 다른 벡터 연산 -> 같은 인덱스의 값만 계산
print(ages + pd.Series([1,100]))  # 0,1 인덱스만 계산되고 나머지는 누락값(NaN)으로 처리

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

#### 데이터프레임 다루기
- sort_index(ascending=False)

In [167]:
rev_ages = ages.sort_index(ascending=False)
print(rev_ages)  # 인덱스 역순 정렬

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [168]:
print(ages * 2) 

# 같은 인덱스끼리 연산
print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

- Boolean Array

In [169]:
# 데이터프레임의 Age 열의 평균보다 높은 데이터 출력
scientists = pd.read_csv('C:/STUDY/Pandas/scientists.csv')
print(scientists[scientists['Age']> scientists['Age'].mean()])

   Unnamed: 0                  Name        Born        Died  Age  \
1           1        William Gosset  1876-06-13  1937-10-16   61
2           2  Florence Nightingale  1820-05-12  1910-08-13   90
3           3           Marie Curie  1867-11-07  1934-07-04   66
7           7          Johann Gauss  1777-04-30  1855-02-23   77

      Occupation     Born_df     Died_df age_days_dt
1   Statistician  1876-06-13  1937-10-16  22404 days
2          Nurse  1820-05-12  1910-08-13  32964 days
3        Chemist  1867-11-07  1934-07-04  24345 days
7  Mathematician  1777-04-30  1855-02-23  28422 days

In [170]:
# 2,6 인덱스 제외 출력
print(scientists[[True, True, False, True, True, True, False, True]])

   Unnamed: 0               Name        Born        Died  Age     Occupation  \
0           0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1           1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3           3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
4           4      Rachel Carson  1907-05-27  1964-04-14   56      Biologist
5           5          John Snow  1813-03-15  1858-06-16   45      Physician
7           7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

      Born_df     Died_df age_days_dt
0  1920-07-25  1958-04-16  13779 days
1  1876-06-13  1937-10-16  22404 days
3  1867-11-07  1934-07-04  24345 days
4  1907-05-27  1964-04-14  20777 days
5  1813-03-15  1858-06-16  16529 days
7  1777-04-30  1855-02-23  28422 days

In [57]:
scientists[scientists['Occupation'] == 'Chemist']

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
3        Marie Curie  1867-11-07  1934-07-04   66    Chemist

In [59]:
ages[scientists['Occupation'] == 'Chemist'] #시리즈에서도 사용 가능

0    37
3    66
Name: Age, dtype: int64

- 브로드캐스팅

In [61]:
# 시리즈와 같이 모든 요소를 대상으로 연산
# 2를 곱하면 숫자는 2를 곱하고 문자열은 2배로 늘어감
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

#### 시리즈와 데이터프레임의 데이터 처리하기
- 열의 자료형 바꾸기

In [62]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [64]:
# 'Born' 열의 날짜 형식 문자열을 datetime 자료형으로 변경
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [65]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [72]:
# datetime 으로 바뀐 2개의 자료를 새로운 열로 추가
scientists['Born_dt'], scientists['Died_dt'] = (born_datetime, died_datetime)
print(scientists.head())

                   Name        Born        Died  Age    Occupation    born_dt  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

     died_dt    Born_df    Died_df    Born_dt    Died_dt
0 1958-04-16 1920-07-25 1958-04-16 1920-07-25 1958-04-16
1 1937-10-16 1876-06-13 1937-10-16 1876-06-13 1937-10-16
2 1910-08-13 1820-05-12 1910-08-13 1820-05-12 1910-08-13
3 1934-07-04 1867-11-07 1934-07-04 1867-11-07 1934-07-04
4 1964-04-14 1907-05-27 1964-04-14 1907-05-27 1964-04-14

In [68]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   born_dt     8 non-null      datetime64[ns]
 6   died_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 576.0+ bytes

In [73]:
scientists.loc[:,['Name','Born_dt','Died_dt','Age','Occupation']]  # 원하는 열 뽑음

                   Name    Born_dt    Died_dt  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [74]:
# 과학자의 삶의 시간 계산하기
scientists['age_dats_dt'] = (scientists['Died_dt'] - scientists['Born_dt'])
print(scientists)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt    Born_df    Died_df    Born_dt    Died_dt  \
0 1920-07-25 1958-04-16 1920-07-25 1958-04-16 1920-07-25 1958-04-16
1 1876-06-13 1937-10-16 1876-06-13 1937-10-16 1876-06-13 1937-10-16
2 1820-05-12 1910-08-13 1820-05-12 1910-08-13 1820-05-12 1910-08-13
3 1867-11-07 1934-07-04 1867-11-07 1934-07-04 1867-11-07 1934-07-04
4 1907-05-27 1964-04-14 1907-05-27 1964-04-14 1907-05-27 1964-04-14
5 1813-03-15 1858-06-16 1813-03-15 1858-06-16 1813-03-15 1858-06-16
6 1912-06-23 1954-06-07 1912-06-23 1954-06-07 1912-06-23 1954-06-07
7 1777-04-30 1855-02-23 1777-04-30 1855-02-23 1777-04-30 1855-02-23

  age_dats_dt
0  13779 days
1  22404 days
2  32964 days
3  24345 days
4  20777 days
5  16529 days
6  15324 days
7  28422 days

- 데이터 삭제하기 - drop

In [76]:
# 인덱스(행) 삭제
scientists.drop(0).head(2)

,Name,Born,Died,Age,Occupation,born_dt,died_dt,Born_df,Died_df,Born_dt,Died_dt,age_dats_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days

In [78]:
# 특정 인덱스(행) 삭제
scientists.drop([0,3])

,Name,Born,Died,Age,Occupation,born_dt,died_dt,Born_df,Died_df,Born_dt,Died_dt,age_dats_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,1813-03-15,1858-06-16,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,1912-06-23,1954-06-07,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,1777-04-30,1855-02-23,1777-04-30,1855-02-23,28422 days

In [80]:
scientists.drop('Name', axis = 1)  # 여기선 수직지울때 1 사용

,Born,Died,Age,Occupation,born_dt,died_dt,Born_df,Died_df,Born_dt,Died_dt,age_dats_dt
0,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,1920-07-25,1958-04-16,1920-07-25,1958-04-16,13779 days
1,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days
3,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,1867-11-07,1934-07-04,1867-11-07,1934-07-04,24345 days
4,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14,1907-05-27,1964-04-14,20777 days
5,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,1813-03-15,1858-06-16,1813-03-15,1858-06-16,16529 days
6,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,1912-06-23,1954-06-07,1912-06-23,1954-06-07,15324 days
7,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,1777-04-30,1855-02-23,1777-04-30,1855-02-23,28422 days

In [81]:
# 인덱스 또는 열 이름 삭제
# 열삭제
scientists.drop('Age',axis=1).head(2)

,Name,Born,Died,Occupation,born_dt,died_dt,Born_df,Died_df,Born_dt,Died_dt,age_dats_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,1920-07-25,1958-04-16,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days

In [ ]:
scientists.drop(['Age','Occupation'],axis=1)

In [87]:
list1=[1,2,3]
list2=list1   # list2 = list1.copy()

In [89]:
list2[0] =4
list2

[4, 2, 3]

In [93]:
list1 # 같이 변함

[4, 2, 3]

In [94]:
list1 is list2  # copy 를 사용하면 결과 False 나옴

True

#### 데이터 저장하고 불러오기
- pickle
> 데이터를 바이너리 형태로 직렬화 하여저장
> 적은 용량으로 저장 가능

In [171]:
names = scientists['Name']

In [172]:
names.to_pickle('scientists_names_series.pickle')

In [173]:
pd.read_pickle('C:/STUDY/Pandas/scientists_names_series.pickle')

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [123]:
# CSV
scientists['Name'].to_csv('scientists_names_series.csv')

In [143]:
scientists.to_csv('C:/STUDY/Pandas/scientists.csv','\t')

In [174]:
df = pd.read_csv('C:/STUDY/Pandas/scientists.csv')
df

,Unnamed: 0,Name,Born,Died,Age,Occupation,Born_df,Died_df,age_days_dt
0,0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [175]:
# EXCEL
names_df = scientists['Name'].to_frame() # 아래와 같음
names_df = scientists[['Name']]
names_df

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss

In [180]:
!conda install -y xlwt

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\admin\anaconda3

  added / updated specs:
    - xlwt


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.13.0               |   py39haa95532_0         923 KB
    xlwt-1.3.0                 |   py39haa95532_0         160 KB
    ------------------------------------------------------------
                                           Total:         1.1 MB

The following NEW packages will be INSTALLED:

  xlwt               pkgs/main/win-64::xlwt-1.3.0-py39haa95532_0

The following packages will be UPDATED:

  conda                               4.12.0-py39haa95532_0 --> 4.13.0-py39haa95532_0



Downloading and Extracting Packages

conda-4.13.0         | 923 KB    |            |   0%
conda-4.13.0         | 923 KB    | #3         |  14%
conda-4.13.0         | 923 KB    | ########## | 100%
conda-4.13.0         | 923 KB    | ########## | 100%

xlwt-1.3.0           | 160 KB    |            |   0%
xlwt-1.3.0           | 160 KB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

In [181]:
#엑셀데이토 저장 불러오기
import xlwt
import openpyxl

In [188]:
names_df.to_excel('scientists_names_series_df.xls')
names_df.to_excel('scientists_names_series_df.xlsx')

C:\Users\admin\AppData\Local\Temp\ipykernel_8692\3384400256.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('scientists_names_series_df.xls')

In [189]:
pd.read_excel('scientists_names_series_df.xls', index_col=0)

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss